// <전개구문>

// * 배열의 전개구문
const 과일들 = ['사과', '파인애플', '수박'];
const 생선들 = ['조기', '갈치', '다금바리'];
const 합치면 = [...과일들, ...생선들];
const 합치면2 = [과일들, 생선들];

console.log(합치면); //['사과', '파인애플', '수박','조기', '갈치', '다금바리']
console.log(합치면2); // [Array(3), Array(3)]

// * 객체의 전개구문
const 위니브1 = { 개리: 1, 빙키: 2 };
const 위니브2 = { 라이캣: 3 };
const 위니브3 = { ...위니브1, ...위니브2 };

console.log(위니브3); // {개리: 1, 빙키: 2, 라이캣: 3}

// 객체의 전개구문 실무에서는 아래와 같이 쓰인다
const 위니브임직원 = {
  개리: '재직중',
  빙키: '재직중',
  라이켓: '재직중',
  뮤라: '재직중',
  해골왕: '재직중',
};

const 위니브임직원2 = {
  ...위니브임직원,
  라이켓: '휴가',
  해골왕: '퇴사',
};

console.log(위니브임직원2); // {개리: '재직중', 빙키: '재직중', 라이켓: '휴가', 뮤라: '재직중', 해골왕: '퇴사'}

const 위니브임직원3 = {
  ...위니브임직원,
}; // 위니브임직원이 복사된다

// ---------------------------------------- *

// <구조분해할당>
for (const [i, j] of [
  [1, 2],
  [3, 4],
  [5, 6],
]) {
  console.log(i, j);
} // 1 2 // 3 4 // 5 6

const 위니브임직원4 = {
  개리: '재직중',
  빙키: '재직중',
  라이켓: '재직중',
  뮤라: '재직중',
  해골왕: '재직중',
};
Object.entries(위니브임직원4); // [Array(2), Array(2), Array(2), Array(2), Array(2)]
// 0: ['개리', '재직중']
// 1: ['빙키', '재직중']
// 2: ['라이켓', '재직중']
// 3: ['뮤라', '재직중']
// 4: ['해골왕', '재직중']

for (const [i, j] of Object.entries(위니브임직원4)) {
  console.log(i, j);
} // 개리 재직중 // 빙키 재직중 // 라이켓 재직중 // 뮤라 재직중 // 해골왕 재직중

let [a, b] = [10, 20]; // 선언할 때도 쓰인다
let [one, two, three] = '010-2057-9265'.split('-');
// one '010' // two '2057' // three '9265'
let [one1, two1, ...three1] = '010-2057-9265-123-123'.split('-');
// one1 '010' // two1 '2057' // three1 ['9265', '123', '123']
console.log([one1, two1, ...three1]);
// ['010', '5044', '2903', '123', '123']

//////////////

const test = [
  [1, 2, [10, 20]],
  [3, 4, [30, 40]],
  [5, 6, [50, 60]],
];

// 1.
for (const [i, j] of test) {
  console.log(i, j);
} //1 2 // 3 4 // 5 6

// 2.
for (const [i, j, k] of test) {
  console.log(i, j, k);
} //1 2 [10, 20] // 3 4 [30, 40] // 5 6 [50, 60]

// i, j, k, l, m, n
// 3.
for (const [i, j, [k, l]] of test) {
  console.log(i, j, k, l);
}

// 아래 코드는 기억할 것! //
const test1 = [
  [1, 2, 10, 20],
  [3, 4, 30, 40],
  [5, 6, 50, 60],
];
for (const [i, j, ...k] of test1) {
  console.log(i, j, k);
} // 1 2 10 20 // 3 4 30 40 // 5 6 50 60

////

function hello(a, b, ...c) {
  console.log(a, b, c);
}

hello(1, 2, 3, 4, 5, 6, 7); // 1 2 [3, 4, 5, 6, 7]
